const students = [
  {
    name: "Олена",
    age: 20,
    grade: 85,
    city: "Київ",
  },
  {
    name: "Максим",
    age: 22,
    grade: 92,
    city: "Львів",
  },
  {
    name: "Анна",
    age: 19,
    grade: 78,
    city: "Київ",
  },
  {
    name: "Ігор",
    age: 21,
    grade: 88,
    city: "Одеса",
  },
  {
    name: "Марія",
    age: 20,
    grade: 95,
    city: "Львів",
  },
];

//! ==============================
//! REDUCE
//! ==============================

//? Задача 9: Використай reduce для підрахунку середньої оцінки всіх студентів
// const avrNumber = students.reduce((accum, num, i, ar) => {
//   accum += num.grade;
//   if (i === ar.length - 1) {
//     return accum / ar.length;
//   }
//   return accum;
// }, 0);
// console.log("🚀 ~ avrNumber:", avrNumber);

//? Задача 11: Використай reduce для знаходження суми всіх чисел

//* Підрахунок елементів
// Порахуй кількість елементів у масиві ['a', 'b', 'c', 'd'] за допомогою reduce()

//* Конкатенація рядків
// Об'єднай всі слова з масиву ['Привіт', 'як', 'справи'] в одне речення
// const slova = ["Привіт", "як", "справи"];

// const slovaRazom = slova.reduce((accum, word) => {
//   return `${accum} ${word}`;
// }, "");
// console.log("🚀 ~ slovaRazom:", slovaRazom);

//! =======================================
//! ЧАСТИНА 4: TOSORTERED ТА СОРТУВАННЯ
//! =======================================

//? Задача 13: Відсортуй числа за зростанням (використай toSorted)
// const points = [40, 100, 1, 5, 25, 10];
// const pointsSort = points.toSorted((a, b) => a - b);
// console.log("🚀 ~ pointsSort:", pointsSort);

//? Задача 14: Відсортуй числа за спаданням
// const points = [40, 100, 1, 5, 25, 10];
// const pointsSort = points.toSorted((a, b) => b - a);
// console.log("🚀 ~ pointsSort:", pointsSort);

//? Задача 15: Відсортуй слова за алфавітом (без урахування регістру)
// const words = ["Яблуко", "апельсин", "Банан", "груша"];
// const pointsSort = words.toSorted((a, b) => a.localeCompare(b));
// console.log("🚀 ~ pointsSort:", pointsSort);

//? Задача 16: Відсортуй студентів за оцінкою (від найвищої до найнижчої)

// const gradeDscr = students.toSorted((a, b) => b.grade - a.grade);
// console.log("🚀 ~ gradeDscr:", gradeDscr);

//! =======================================
//! Завдання з JS сортування (toSorted і localeCompare)
//! =======================================

//? Сортування рядків
//? Відсортуй масив ['banana', 'apple', 'cherry', 'date'] в алфавітному порядку
// const masivWords = ["banana", "apple", "cherry", "date"];

// Сортування за спаданням
//? Відсортуй масив чисел [15, 3, 27, 8, 42] від найбільшого до найменшого
// const masive = [15, 3, 27, 8, 42];

//! =======================================
//! Задача Каскад
//! =======================================

// 	1.	Видалити пробіли з початку та кінця (trim)
// 	2.	Перевести всі літери в верхній регістр (toUpperCase)
// 	3.	Відсортувати за алфавітом
const fruits = ["  Mango", "apple  ", "BANANA", "Kiwi  "];

//? Відсортуй масив + Upper
// const masive = ["їжак", "єнот", "ящірка", "індик"];

//! =======================================
//! ЧАСТИНА 5: FLATMAP
//! =======================================

const classes = [
  {
    className: "10-А",
    students: ["Петро", "Оля", "Іван"],
  },
  {
    className: "10-Б",
    students: ["Марія", "Сергій"],
  },
  {
    className: "11-А",
    students: ["Анна", "Максим", "Ольга", "Дмитро"],
  },
];

//? Задача 18: Використай flatMap для отримання плоского масиву всіх імен студентів

//! =======================================
//! ЧАСТИНА 6: ЛАНЦЮЖКИ МЕТОДІВ
//! =======================================

const products = [
  {
    name: "Ноутбук",
    price: 25000,
    category: "Електроніка",
    inStock: true,
  },
  {
    name: "Телефон",
    price: 15000,
    category: "Електроніка",
    inStock: true,
  },
  {
    name: "Стіл",
    price: 5000,
    category: "Меблі",
    inStock: false,
  },
  {
    name: "Стілець",
    price: 2000,
    category: "Меблі",
    inStock: true,
  },
  {
    name: "Планшет",
    price: 12000,
    category: "Електроніка",
    inStock: true,
  },
  {
    name: "Лампа",
    price: 800,
    category: "Меблі",
    inStock: true,
  },
];

//? Задача 20: Знайди всі товари категорії "Електроніка", які є в наявності,
// відсортуй їх за ціною (від дешевших до дорожчих) і поверни масив їх назв
// Використай ланцюжок методів: filter -> toSorted -> map

// prettier-ignore
// const sortProduct = products
//   .filter((stock) => stock.category === "Електроніка")
//   .toSorted((a, b) => a.price - b.price)
//   .map((val) => val.name);
// console.log("🚀 ~ sortProduct:", sortProduct);

//? Задача 21: Знайди середню ціну всіх товарів, які є в наявності
// Використай ланцюжок: filter -> map -> reduce

// prettier-ignore
// const sortProduct = products
//     .filter((stock) => stock.inStock === true)
//     .map((val) => val.price)
//     .reduce((accum, el, i, arr) => {
//         return accum + el / arr.length
//     }, 0);

// console.log("🚀 ~ sortProduct:", sortProduct);

// Рівень 1: Базові задачі
// Задача 1: Привітання великими літерами
// Напишіть функцію shout(text), яка перетворює текст у великі літери.

//! Задача 3: Видалення пробілів
// Напишіть функцію cleanText(text), яка видаляє пробіли на початку та в кінці рядка.

// const first = "  MyEmail@Gmail.COM ";
// // const second = "   world   ";

// // prettier-ignore
// function cleanText(text) {
//   return text.trim().toLowerCase().split('');
// }

// const result = cleanText(first);
// console.log(result);

// Задача 13: Перевірка паролю (проста)
// Напишіть функцію isStrongPassword(password), яка перевіряє:
// Довжина >= 6 символів
// Містить "@"

//! Перевірка паліндрома
//! Функція isPalindrome(str) повертає true, якщо рядок читається однаково зліва направо і справа наліво.

// function isPalindrome(str) {
//     for (let i = 0; i < str.length / 2; i++) {
//         if (str[i] !== str[str.length - 1 - i]) {
//             return false
//         }
//     }
//     return true
// }

// isPalindrome("level"); // true
// isPalindrome("hello"); // false
// console.log("🚀 ~ isPalindrome:", isPalindrome(""));

// const isPalindrome = (str) => {

// }

// !!!!!!!!!!!!!!!!!
//* Стартове слово
// const word = "hello";
// console.log("🚀 ~ word:", word);

//* Розділяємо на букви - Перевертаємо - Збираємо слово reverse
// const rozdil = word.split("").toReversed().join("");
// console.log("🚀 ~ rozdil:", rozdil);

//* Перевірка
// function isPalindrome(word) {
//   return word === rozdil;
// }
// console.log("🚀 ~ isPalindrome ~ isPalindrome:", isPalindrome(word));

//* Перевертаємо
// const revers = rozdil.toReversed();
// console.log("🚀 ~ revers:", revers);

//* Збираємо слово reverse
// const revWord = revers.join("");
// console.log("🚀 ~ revWord:", revWord);

//* Стартове слово
// const word = "level";
// console.log("🚀 ~ word:", word);

// // prettier-ignore
// const verifi = word => word
//     .split("")
//     .toReversed()
//     .join("")

// const result = word === verifi(word);
// console.log(result);
